app/controllers/account_activations_controller.rb

    def edit
      user = User.find_by(email: params[:email])
      if user && !user.activated? && user.authenticated?(:activation, params[:id])
        user.update_attribute(:activated,    true)
        user.update_attribute(:activated_at, Time.zone.now)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "activated" = ? WHERE "users"."id" = ?  [["updated_at", "2024-02-22 09:31:07.838681"], ["activated", 1], ["id", 103]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2024-02-22 09:31:07.845819"], ["activated_at", "2024-02-22 09:31:07.845544"], ["id", 103]]