app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "check"], ["user_id", 101], ["created_at", "2024-02-22 03:44:51.184397"], ["updated_at", "2024-02-22 03:44:51.184397"]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "bard generated"], ["user_id", 101], ["created_at", "2024-02-22 04:42:21.972381"], ["updated_at", "2024-02-22 04:42:21.972381"]]
SELECT "microposts".* FROM "microposts" WHERE (user_id = 101) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 101]]
---
    def create
      @micropost = current_user.microposts.build(micropost_params)
      @micropost.image.attach(params[:micropost][:image])
      if @micropost.save
        flash[:success] = "Micropost created!"
        redirect_to root_url
      else
        @feed_items = current_user.feed.paginate(page: params[:page])