app/models/user.rb

  def feed
      following_ids = "SELECT followed_id FROM relationships
      WHERE  follower_id = :user_id"
      Micropost.where("user_id IN (#{following_ids})
      OR user_id = :user_id", user_id: id)
      .includes(:user, image_attachment: :blob)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]